OdGeCurve3d.closestPointTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified point.
\param point  [in]  Any 3D point.
\param param [out]  uv-coord of closest point.
\param range  [in]  interval of closest point.
\param tol    [in]  Geometric tolerance.
\remarks
Native interval is not considered.
If projection of the point does not lie in range-interval, the closest bound
of the interval is returned. In case of uvBox == NULL
closestPointTo(point, range, tol) is called where range is a native curves
interval. An unbounded interval should not be used here.